app/controllers/lineitems_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_item(product.id)
    #@line_item = LineItem.new(line_item_params)
    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-06-15 02:55:31.773135"], ["updated_at", "2017-06-15 02:55:31.773135"]]
INSERT INTO "lineitems" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 2], ["cart_id", 1], ["created_at", "2017-06-15 02:55:31.872090"], ["updated_at", "2017-06-15 02:55:31.872090"]]
UPDATE "lineitems" SET "quantity" = ?, "updated_at" = ? WHERE "lineitems"."id" = ?  [["quantity", 2], ["updated_at", "2017-06-16 01:35:45.623094"], ["id", 6]]