app/controllers/search_controller.rb

  def index
    @products = Product.all
    if params[:search]
      @products = Product.search(params[:search]).order(:name)
---
SELECT "products".* FROM "products" WHERE (description LIKE '%java%' OR name LIKE '%java%' OR price = 'java') ORDER BY "products"."name" ASC